{
    "tasks": [
        {
            "type": "Текст",
            "title": "Вовед",
            "description": "",
            "topic": "Вовед",
            "difficulty": 4
        },
        {
            "type": "Текст",
            "title": "Работна околина",
            "description": "",
            "topic": "Вовед",
            "difficulty": 8
        },
        {
            "type": "Задача",
            "title": "Тетратка",
            "externalLink": "https://mendo.mk/Task.do?id=79",
            "description": "Дарко е ученик во основно училиште. Бидејќи не внимава доволно на часовите по математика, во тетратката на Дарко фалат неколку знаци од примерите кои ги решавала неговата наставничка (поради брзање тој не успеал добро да ги препише операторите во равенките).\nБидејќи Дарко знае дека вие учествувате во натпреварите по информатика организирани од страна на ЗИМ, тој се обратил до вас да му помогнете така што ќе напишете програма која ќе ги надополни равенките. Сите равенки се од истиот облик А#B=C, и ваша задача е да го пронајдете пропуштениот аритметички оператор (кој треба да дојде на местото на # - помеѓу A и B).\nНапишете програма која од стандарден влез (тастатура) ќе прочита три цели броја A, B и C (кои соодветствуваат на проблемот A#B=C), ќе одреди кој од аритметичките оператори (+, -, *, /) треба да се постави на местото на # (помеѓу A и B) за да равенката (A#B=C) биде задоволена, и потоа на стандарден излез ќе ја отпечати равенката A#B=C (нормално, на местото на # треба да стои бараниот оператор). ",
            "input": "Првата и единствена линија од влезот содржи три цели броја одвоени со празно место: А, B и C, 1 <= A, B, C <= 1000 и B <= A.\nТест случаите ќе бидат направени така што секогаш ќе има точно едно решение. Во сите тест случаи B ќе биде делител на A (A/B ќе биде цел број). ",
            "output": "Првата и единствена линија од излезот треба да ја содржи комплетната равенка. Внимавајте да нема празно место или знак за нов ред помеѓу A, операторот, B, = (еднаквото) и C.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "4 2 6",
                    "output": "4+2=6"
                },
                {
                    "input": "9 3 27",
                    "output": "9*3=27"
                },
                {
                    "input": "5 5 1",
                    "output": "5/5=1"
                }
            ],
            "solution": "s\\tetratka.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 10
        },
        {
            "type": "Задача",
            "title": "Точка",
            "externalLink": "https://mendo.mk/Task.do?id=83",
            "description": " Дадени се координатите px, py на долното лево теме на правоаголник со страни паралелни со координатните оски. Должините на страните на правоаголникот се a и b, каде a е должината на страната паралелна со x-оската (апцисата), додека b e должината на страната паралелна со y-оската (ординатата).\n<img src=\"https://mendo.mk/task_files/oski2.gif\"> \nНапишете програма која од стандарден влез ќе ги прочита координатите на долното лево теме на правоаголникот px, py, должините на неговите страни a и b и координатите tx и ty на произволна точка од рамнината, и на стандарден излез (екран) ќе отпечати:\n\"strana\" - доколку точката (tx, ty) лежи на некоја од страните на правоаголникот, или на едно од неговите темиња\n\"vnatre\" - доколку точката (tx, ty) е внатре во правоаголникот\n\"nadvor\" - доколку точката (tx, ty) е надвор од правоаголникот  ",
            "input": "Во првиот ред се запишани 4 цели броеви px, py (0 ≤ px, py ≤ 1000), a и b (1 ≤ a, b ≤ 1000), по тој редослед.\nВо вториот ред се запишани координатите на точката T - tx, ty (0 ≤ tx, ty ≤ 1000).",
            "output": " На стандарден излез отпечатете \"strana\", \"vnatre\" или \"nadvor\" (без наводниците), соодветно.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "1 2 3 2\n4 1",
                    "output": "nadvor"
                },
                {
                    "input": "0 0 3 3\n2 2",
                    "output": "vnatre"
                },
                {
                    "input": "1 1 1 1\n1 1",
                    "output": "strana"
                }
            ],
            "solution": "s\\tochka.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 17
        },
        {
            "type": "Задача",
            "title": "Факториел",
            "externalLink": "https://mendo.mk/Task.do?id=237",
            "description": "Во математиката, факториел на позитивен цел број N (се означува со N!) претставува производ на сите природни броеви помали или еднакви на N. На пример,\n5! = 5 * 4 * 3 * 2 * 1 = 120\nВредноста на 0! е 1. ",
            "input": "Во првиот ред се наоѓа природниот број N (0 <= N <= 10) за кој ќе пресметуваме факториел.",
            "output": "Излезот се состои од еден ред во кој треба да го отпечатите резултатот N!.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "2",
                    "output": "2"
                },
                {
                    "input": "3",
                    "output": "6"
                }
            ],
            "solution": "s\\faktoriel.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 10
        },
        {
            "type": "Задача",
            "title": "Број на цифри",
            "externalLink": "https://mendo.mk/Task.do?id=238",
            "description": "За даден број N, да се определи неговиот број на цифри.",
            "input": "Во првиот ред се наоѓа природниот број N (0 <= N <= 30000) за кој треба да го пресметаме бројот на цифри.",
            "output": "Излезот се состои од еден ред во кој треба да го отпечатите бројот на цифри на N.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "2",
                    "output": "1"
                },
                {
                    "input": "123",
                    "output": "3"
                }
            ],
            "solution": "s\\broj_na_cifri.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 14
        },
        {
            "type": "Задача",
            "title": "Содржател",
            "externalLink": "https://mendo.mk/Task.do?id=240",
            "description": "Да се најде НЗС (најмал заеднички содржател) за внесени два природни броеви M и N.",
            "input": "Во првиот ред се наоѓаат природните броеви M и N (1 <= M, N <= 500). Броевите се одделени со еден знак за празно место.",
            "output": "Излезот се состои од еден ред во кој треба да го отпечатите пресметаниот НЗС.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "2 3",
                    "output": "6"
                },
                {
                    "input": "6 2",
                    "output": "6"
                }
            ],
            "solution": "s\\sodrzhatel.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 18
        },
        {
            "type": "Задача",
            "title": "Факторизација",
            "externalLink": "https://mendo.mk/Task.do?id=29",
            "description": "Напишете програма која од стандарден влез ќе прочита еден природен број N, и на стандарден излез ќе ја испечати факторизацијата на тој број.\nПод факторизација на природен број се подразбира неговото претставување како производ од прости фактори (прост број на степен). Прост број е природен број кој има точно два делители (1 и самиот тој број). Првите неколку прости броеви се 2, 3, 5, 7, 11, 13, 17, итн...",
            "input": "Од стандарден влез се чита еден цел број N (2 <= N <= 100000).",
            "output": "На стандарден излез отпечатете ја факторизацијата на бројот N. Простите фактори се печатат во загради како број на (^) степен, а се одделени со знакот за множење (*).\nФакторите треба да се подредени од оној фактор со најмала основа, кон оние со поголема основа. Не смее да има знак * на крајот на излезот. Видете го тест-случајот даден подолу за конкретен пример...",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "1176",
                    "output": "(2^3)*(3^1)*(7^2)"
                }
            ],
            "solution": "s\\faktorizacija.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 32
        },
        {
            "type": "Задача",
            "title": "Спратови",
            "externalLink": "https://mendo.mk/Task.do?id=2",
            "description": "Сите деца ја знаат песничката „Топчето ми падна, Калина го грабна...“. Затоа децата кога си играат со топче на тераса во зграда внимаваат топчето да не им падне.\nНо, иако Калина чека долу пред зградата, таа не може секогаш да го грабне топчето, бидејќи некогаш кога топчето ќе падне, тоа се крши и е неупотребливо. Притоа, ако топчето се фрли од Fi-тиот спрат и се скрши, тоа ќе се скрши и доколку се фрли од сите погорни спратови. Доколку пак, топчето се фрли од Fi-тиот спрат и не се скрши, нема да се скрши и доколку се фрли од сите пониски спратови.\nДоколку се дадени информациите за N фрлени топчиња, напишете програма која ќе го пресмета најголемиот интервал од спратови за кој не се знае дали фрлањето на пластично топче од спратовите во тој интервал ќе доведе до кршење на топчето или не.\nЗабелешка: Секогаш во примерите ќе има барем еден спрат за кој не се знае дали топчето фрлено од него ќе се скрши или не.",
            "input": "Во првиот ред е запишан бројот на фрлени топчиња N (3 <= N <= 10000). Во секој од следните N редови е запишан по еден цел број Fi (1 <= Fi <= 10000) и зборот DA или NE, кои означуваат дали при фрлањето од Fi спрат топчето се скршило или не.",
            "output": "Излезот се состои од еден ред во кој треба да ги отпечатите границите на интервалот за кој нема доволно информации за да се одреди дали топчето ќе се скрши или не.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "4\n1 NE\n7 DA\n3 NE\n9 DA",
                    "output": "4 6"
                }
            ],
            "solution": "s\\spratovi.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 20
        },
        {
            "type": "Задача",
            "title": "Часовник",
            "externalLink": "https://mendo.mk/Task.do?id=81",
            "description": "Дарко се запознал со Марија вечерта на Нова година, на градскиот плоштад, под големиот часовник, кога тој отчукал 12 часот. После одредено време тој сфатил дека е заљубен во неа. Како подарок за претстојниот празник на вљубените сакал да и напише песна. Во неа сакал да спомене колку полни завртувања направила малата стрелка на часовникот (онаа која означува колку е часот) од моментот на запознавање до моментот кога тој сфатил дека е заљубен во неа.\nАко тој знае точно колку часа траел тој период, помогнете му да го утврди податокот што му треба.\nЗначи, напишете програма која од стандарден влез ќе прочита еден цел број N - кој означува број на изминати часови, и на стандарден излез ќе отпечати колку полни завртувања ќе направи малата стрелка на големиот часовник за тој период.",
            "input": "Од стандарден влез се чита еден цел број N (0 ≤ N ≤ 10000) - кој го означува бројот на изминати часови.",
            "output": "На стандарден излез отпечатете колку полни завртувањa ќе направи малата стрелка на часовникот за период од N часови.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "123",
                    "output": "10"
                },
                {
                    "input": "11",
                    "output": "0"
                }
            ],
            "solution": "s\\chasovnik.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 5
        },
        {
            "type": "Задача",
            "title": "Роденден",
            "externalLink": "https://mendo.mk/Task.do?id=41",
            "description": "Семејството Мендовски го има за гостин вонземјанинот Тимби. Тие решиле да му приредат забава за неговиот роденден. Но, Тимби има толку многу години што не е можно да му се купат толку свеќички за роденденската торта. Наместо тоа, малиот Ламбе Мендовски предложил да се купат фигури во форма на бројки, од кои ќе се состави бројот на години на Тимби.\nВо блиската продавница баш се продаваат такви фигури, но во пакети кои ги содржат сите цифри од 0 до 9 по еднаш.\nВаша задача е да направите програма која ќе пресмета колку пакети е потребно да се купат за да се состави бројот на години на Тимби. Внимавајте, цифрата 6 може да се искористи и како 9-ка и обратно.",
            "input": " Во првиот и единствен ред е даден целиот број N (1 <= N <= 32000), кој го претставува бројот на години на Тимби. ",
            "output": " На стандарден излез треба да се отпечати бројот на пакети од цифри кои се потребни за да се состави бројот на години на Тимби.",
            "limitations": {
                "time": "1 секунда",
                "memory": "64 мегабајти"
            },
            "examples": [
                {
                    "input": "6663",
                    "output": "2"
                }
            ],
            "solution": "s\\rodenden.cpp",
            "explanation": "",
            "topic": "Вовед",
            "difficulty": 30
        }
    ]
}