{
  "title": "NST",
  "intro": "NST e алатка за пишување на приказни, раскази, поеми и останати форми на текст на начин на кој настаните можат да зависат од одлуките на читателот. <br><br>Настаните меѓусебно можат да содржат зависности како: <br><br>А може да се случи ако Б веќе се случило.<br> А може да се случи ако и Б може да се случи.<br> А може да се случи ако некогаш имало можност да се случи Б.<br> А може да се случи ако Б се случува во моментот. <br><br><br><br><a class=\"anchorButton orange\" href=\"#kako-raboti\">Како работи?</a><a class=\"anchorButton orange\" href=\"#kade-da-pochnam\">Каде да почнам?</a><a class=\"anchorButton\" href=\"https://www.najjak.com/nst/NST.zip\">Симни 📥</a><br><br><br><div class=\"note\">Ја искористи алатката на некој креативен начин? Испрати ми слика, видео или *.nts и *.chr фајлови!</div><div class=\"notice\">NST е во АЛФА верзија, a тоа значи дека можат да се јават проблеми во користењето. Ако имаш сугестија за подобрување или некаков проблем контактирај ме на линковите подолу.</div><div class=\"note\">Можиш да ме најдиш на <a class=\"anchorButton compact\" href=\"mailto:deeeeelay@gmail.com\">мејл</a> или на <a class=\"anchorButton compact\" href=\"https://www.instagram.com/najnajjak/\">инстаграм</a> или на <a class=\"anchorButton compact\"  href=\"https://discord.gg/sxeD79nuBP\">дискорд</a></div>",
  "sections": {
    "section-howitworks": {
      "caption": "Како работи?",
	  "anchor": "kako-raboti",
      "content": "Секој настан во реалноста доведува до некоја нова состојба на реалноста.<br><br> На пример, една состојба е „Миле разговара со Јасна“ која зависи од состојбата „Миле ја запознава Јасна“. Кога Миле ја запознава Јасна тогаш Миле знае за постоењето на Јасна и може да разговара со неа. Но, Миле може да одлучи да се запознае со Горан наместо со Јасна притоа губејќи ја шансата да зборува со Јасна, а со тоа и да дознае информации од Јасна.<br><br> NST е алатка која овозможува правење на вакви релации меѓу состојби правејќи го искуството за секој читател различно.<br><br>Главните компоненти во NST системот се личностите и состојбите. Преку дијалог со некоја личност се менува состојбата во која се наоѓа читателот."
    },
    "section-wheretostart": {
      "caption": "Каде да почнам?",
	  "anchor": "kade-da-pochnam",
      "content": "NST можете да го симнете <a class=\"anchorButton\" href=\"https://www.najjak.com/nst/NST.zip\">ТУКА 📥</a> <br><br>Откако ќе го симнете <b>NST.zip</b> можете да го отпакувате било каде на вашиот диск. За да ја стартувате програмата кликнете два пати на <b>NSTEditor.exe</b>. При првото стартување на програмата треба да се појави прозорец како на сликата. <br><br> <img src=\"screenshots/startup_mk.png\">"
    },
	"section-creatingstories": {
      "caption": "Создавање приказни",
	  "anchor": "",
      "content": "Со кликање на <div class=\"menuPath\">Датотека → Нова</div> се создава нова приказна која добива уникатно име.<br><br> Името на приказната се менува со зачувување на истата преку <div class=\"menuPath\">Датотека → Зачувај како → (ново име) → Потврди</div>.<br><br> Зачувана приказна може да се вчита преку менито <div class=\"menuPath\">Вчитај → (име)</div>. Во горниот лев агол стои името на моментално вчитаната приказна."
    },
	"section-creatingcharacters": {
      "caption": "Создавање личности",
	  "anchor": "",
      "content": "Алатката за создавање личноси се отвора преку менито <div class=\"menuPath\">Прозорец → Уредувач на личности</div>. Уредувачот на личности изгледа како на сликата подолу.<br><br> <img src=\"screenshots/charEditor_mk.png\" /><br><br>Нова личност се создава преку менито <div class=\"menuPath\">Личност → Нова</div> во уредувачот на личности. Листата на личности се појавува под полето <div class=\"menuPath\">Филтрирај личности</div> и секоја личност може да се одбере со клик над името.<br><br> За секоја личност може да се промени името на таа личност и описот (каква е неговата/нејзината улога во приказната), додека полето <div class=\"menuPath\">Однос</div> го рефлектира моменталниот однос што таа личност ја има со читателот. Односот може да биде позитивен (максимум 100) или негативен (минимум -100). Дали нешто може да се случи може да биде зависно и од односот кој читателот го има со тој лик.<br><br>Откако ќе бидат направени сите промени на карактерот се одбира <div class=\"menuPath\">Личност → Ажурирај</div>.<div class=\"notice\">Ажурирање на личноста ќе ги промени атрибутите на личноста во целиот систем, но нема да го зачува системот. За зачувување мора да се кликне на <div class=\"menuPath\">Датотека → Зачувај</div>"
    },
	"section-creatingstates": {
      "caption": "Создавање состојби во приказната",
	  "anchor": "",
      "content": ""
    },
	"section-creatingdependencies": {
      "caption": "Создавање врски меѓу состојби",
	  "anchor": "",
      "content": ""
    },
	"section-creatingbranches": {
      "caption": "Создавање гранки",
	  "anchor": "",
      "content": ""
    },
	"section-usingadditionaltools": {
      "caption": "Користење на помошни алатки",
	  "anchor": "",
      "content": ""
    },
	"section-tipsandtricks": {
      "caption": "Совети и трикови",
	  "anchor": "",
      "content": ""
    },
	"section-wheretonext": {
      "caption": "Каде понатаму?",
	  "anchor": "",
      "content": ""
    }
  }
}