{
  "title": "NST",
  "caption": "<img src=\"logo.png\" width=\"50%\"/>",
  "intro": "NST e алатка за пишување на приказни, раскази, поеми и останати форми на текст на начин на кој настаните можат да зависат од одлуките на читателот. <br><br>Настаните меѓусебно можат да содржат зависности како: <br><br>А може да се случи ако Б веќе се случило.<br> А може да се случи ако и Б може да се случи.<br> А може да се случи ако некогаш имало можност да се случи Б.<br> А може да се случи ако Б се случува во моментот. <br><br><a class=\"anchorButton\" href=\"https://www.najjak.com/nst/NST.zip\">Симни 📥</a><a class=\"anchorButton\" href=\"#guide\">Водич 🦮</a><br><div class=\"note\">Минимални барања:<br>Оперативен систем: <b>Windows 10 (x64)</b><br>Графичка картица: <b>Intel HD Graphics</b><br>Процесор: <b>Intel Core i3-530</b><br>РАМ меморија: <b>80 Mb</b><br>Меморија на диск: <b>20 Mb</b><br> Софтвер: <b>DirectX 11</b> и <a class=\"anchorButton compact\" href=\"https://aka.ms/vs/16/release/vc_redist.x64.exe\">Microsoft Visual C++ Redistributable 📥</a><br> (на повеќето системи се веќе инсталирани)</div><div class=\"note\">Ја искористи алатката на некој креативен начин? Испрати ми слика, видео или *.nts и *.chr фајлови!</div><div class=\"notice\">NST е во АЛФА верзија, a тоа значи дека можат да се јават проблеми во користењето. Ако имаш сугестија за подобрување или некаков проблем контактирај ме на линковите подолу.</div><div class=\"note\">Моето име е Мартин и можeш да ме најдeш на <a class=\"anchorButton compact\" href=\"mailto:deeeeelay@gmail.com\">мејл</a> или на <a class=\"anchorButton compact\" href=\"https://www.instagram.com/najnajjak/\">инстаграм</a> или на <a class=\"anchorButton compact\"  href=\"https://discord.gg/sxeD79nuBP\">дискорд</a></div>",
  "guideTitle": "🦮 Водич",
  "filterTitle": "Пребарај...",
  "sections": {
    "section-howitworks": {
      "caption": "⚙️ Како NST работи?",
	  "anchor": "kako-raboti",
      "content": "Секој настан доведува до некоја нова состојба на реалноста, а NST е алатка која им овозможува на писателите да прават врски меѓу настаните и состојбите.<br><br>Пример за една состојба е „Миле разговара со Јасна“ која зависи од состојбата „Миле ја запознава Јасна“. Кога Миле ја запознава Јасна тогаш Миле знае за постоењето на Јасна и може да разговара со неа. Но, Миле може да одлучи да се запознае со Горан наместо со Јасна притоа губејќи ја шансата да зборува со Јасна, а со тоа и да дознае информации од Јасна.<br><br> NST е алатка која овозможува правење на релации меѓу состојби правејќи го искуството за секој читател различно.<br><br>Главните компоненти во NST се приказните, личностите и состојбите. Преку дијалог со некоја личност се менува состојбата во која се наоѓа читателот на приказната."
    },
    "section-wheretostart": {
      "caption": "1️ Каде да почнам?",
	  "anchor": "kade-da-pochnam",
      "content": "NST можете да го симнете <a class=\"anchorButton\" href=\"https://www.najjak.com/nst/NST.zip\">ТУКА 📥</a> <br><br>Откако ќе го симнете <b>NST.zip</b> можете да го отпакувате било каде на вашиот диск. За да ја стартувате програмата кликнете два пати на <b>NSTEditor.exe</b>. При првото стартување на програмата треба да се појави прозорец како на сликата. <br><br> <img src=\"screenshots/startup_mk.png\">"
    },
	"section-creatingstories": {
      "caption": "📜 Приказни",
	  "anchor": "prikazni",
      "content": "Приказната е основниот елемент на NST. Таа ги содржи личностите и состојбите.<br><br> Со кликање на <div class=\"menuPath\">Датотека → Нова</div> се создава нова приказна која добива уникатно име.<br><br> Името на приказната се менува со зачувување на истата преку <div class=\"menuPath\">Датотека → Зачувај како → (ново име) → Потврди</div>.<br><br> Зачувана приказна може да се вчита преку менито <div class=\"menuPath\">Вчитај → (име)</div>. Во горниот лев агол стои името на моментално вчитаната приказна."
    },
	"section-creatingcharacters": {
      "caption": "🧔 Личности",
	  "anchor": "lichnosti",
      "content": "Личност е секој со кој ти како читател можеш да правиш интеракција во приказната.<br><br>Алатката за создавање личноси се отвора преку менито <div class=\"menuPath\">Прозорец → Уредувач на личности</div>. Уредувачот на личности изгледа како на сликата подолу.<br><br> <img src=\"screenshots/charEditor_mk.png\" /><br><br>Нова личност се создава преку менито <div class=\"menuPath\">Личност → Нова</div> во уредувачот на личности. Листата на личности се појавува под полето <div class=\"menuPath\">Филтрирај личности</div> и секоја личност може да се одбере со клик над името.<br><br> За секоја личност може да се промени името на таа личност и описот (каква е неговата/нејзината улога во приказната), додека полето <div class=\"menuPath\">Однос</div> го рефлектира моменталниот однос што таа личност ја има со читателот. Односот може да биде позитивен (максимум 100) или негативен (минимум 0). Дали нешто може да се случи може да биде зависно и од односот кој читателот го има со тој лик.<br><br>Откако ќе бидат направени сите промени на личноста се одбира <div class=\"menuPath\">Личност → Ажурирај</div>.<div class=\"notice\">Ажурирање на личноста ќе ги промени атрибутите на личноста во целата приказна, но нема да ја зачува приказната. За зачувување мора да се кликне на <div class=\"menuPath\">Датотека → Зачувај</div>.</div><div class=\"notice\">Селектирање на друга личност автоматски ќе ја ажурира моментално селектираната личност.</div><div class=\"note\">Сите комплексни текстуални полиња препорачано е да се уредуваат со бесплатниот уредувач <a href=\"https://github.com/notepad-plus-plus/notepad-plus-plus/releases/download/v7.9.5/npp.7.9.5.Installer.exe\" class=\"anchorButton compact\">Notepad++</a>, a можат да бидат уредувани и со <a href=\"https://www.microsoft.com/en-us/microsoft-365/word\" class=\"anchorButton compact\">MS Word</a> или со <a href=\"https://download.sublimetext.com/Sublime%20Text%20Build%203211%20x64%20Setup.exe\" class=\"anchorButton compact\">Sublime Text 3</a>. </div>"
    },
	"section-creatingstates": {
      "caption": "⚙️ Состојби",
	  "anchor": "sostojbi",
      "content": "Состојба е еден момент во времето. Секоја состојба има личност на која таа состојба се однесува. На пример, ако ти разговараш со Јасна тогаш таа состојба се однесува на личноста Јасна. Секоја состојба може да зависи од други состојби на различни начини кои ќе се разгледуваат понатаму.<br><br> Сите достапни состојби во системот можат да се видат во прозорецот именуван како <div class=\"menuPath\">Листа на состојби</div> кој може да се прикаже или да се скрие со клик на <div class=\"menuPath\">Прозорец → Листа на состојби</div>. Прозорецот изгледа како на сликата подолу. <br><br><img src=\"screenshots/statesList_mk.png\" /><br><br>Нова состојба во системот се додава со клик на копчето <div class=\"menuPath\">Создај → Нова StateDialog</div>. Со овој клик ќе се создаде нова состојба во системот од тип дијалог. Клик над правоаголникот на состојбата ќе ја селектира состојбата.<br><br>Својствата на секоја состојба можат да се видат во прозорецот наречен <div class=\"menuPath\">Уредувач на состојби</div> кој може да се прикаже или да се скрие преку клик на <div class=\"menuPath\">Прозорец → Уредувач на состојби</div>. Прозорецот изгледа како на сликата подолу.<br><br><img src=\"screenshots/stateEditor_mk.png\" /><br><br>Секоја состојба ги има следните својства:<br><br><div class=\"menuPath\">Име</div>: Уникатно име на состојбата кое служи за идентификација на состојбата за писателот.<br><div class=\"menuPath\">Може да се случи повторно</div>: Ако полето е означено тогаш оваа состојба може да се случи повеќе од еднаш, во спротивно ако состојбата некогаш се случи не е можно подоцна да се случи повторно дури и ако условите се исполнети.<br><div class=\"menuPath\">Поле за израз за достапност</div>: Во ова поле се пишуваат <a class=\"anchorButton compact\" href=\"#izrazi-za-dostapnost\" id=\"sostojba-uslov-dostapnost\">условите за достапност</a> (дали оваа состојба може да се случи) за селектираната состојба.<br><div class=\"menuPath\">Линкови до зависни состојби</div>: Под изразот на достапност се наоѓаат линкови до состојбите кои ги содржи изразот за достапност.<br><div class=\"menuPath\">Ситуација</div>: Текстот кој се прикажува откако оваа состојба ќе биде активирана и ќе постане моменталната состојба на приказната.<br><div class=\"note\">На копчињата по <div class=\"menuPath\">Уреди со</div> може текстот од полето да се отвори во надворешен уредувач во специјален фајл кој NST знае да го прочита откако ќе биде зачуван. Откако промените ќе бидат направени во надворешниот уредувач, едноставно зачувување ќе ги ажурира промените во NST уредувачот.</div><br><div class=\"menuPath\">Преглед</div>: Како текстот кој го внесувате ќе изгледа конечно.<br><div class=\"menuPath\">Израз на дијалогот</div>: Кој дијалог ако биде изберен ќе доведе до оваа состојба на приказната.<br><div class=\"menuPath\">Личност</div>: На која личност се однесува оваа состојба. Кога оваа состојба ќе се случи <div class=\"menuPath\">Ефект врз односот</div> ќе биде аплициран врз личноста.<br><div class=\"menuPath\">Ефект врз односот</div>: Се внесува во %. На пример, -50% ќе значи дека ако оваа состојба се случи тогаш читателот ќе добие негативна реакција од личноста на која се однесува оваа состојба.<br><div class=\"menuPath\">Праг на односот</div>: Се внесува во %, може да биде и позитивно и негативно. Позитивна вредност значи дека за да се случи оваа состојба односот со личноста на која се однесува треба да биде поголем од вредноста. Негативна вредност значи дека за да се случи оваа состојба односот со личноста на која се однесува треба да биде помала од вредноста.<br><br>Откако сите параметри ќе бидат поставени, ажурирање на состојбата во приказната се прави со клик на <div class=\"menuPath\">Состојба → Ажурирај</div>. <div class=\"notice\">Ажурирање на состојбата ќе ги промени атрибутите на состојбата во целата приказна, но нема да ја зачува приказната. За зачувување мора да се кликне на <div class=\"menuPath\">Датотека → Зачувај</div>.</div> <div class=\"notice\">Селектирање на друга состојба автоматски ќе ја ажурира моментално селектираната состојба.</div>Десен клик на состојба во било кој прозорец ќе отвори контекстуално мени кое изгледа како на сликата подолу.<br><br><img src=\"screenshots/stateContextMenu_mk.png\"/><br><br><div class=\"menuPath\">Селектирај</div>: Ќе ја селектира состојбата.<br><div class=\"menuPath\">Пробај активација</div>: Системот ќе проба да ја активира ситуацијата. Ако состојбата е достапна тогаш таа ќе биде активирана, ако не е достапна тогаш не може да биде активирана.<br><div class=\"menuPath\">Форсирај активација</div>: Системот ќе ја активира состојбата без разлика дали е таа достапна.<br><div class=\"menuPath\">Намести почетна состојба тука</div>: Оваа состојба ќе биде почетна состојба и приказната ќе започнува тука.<br><div class=\"menuPath\">Ресетирај </div>: Состојбата ќе ги добие своите иницијални параметри без разлика од моменталната состојба на приказната.<br><div class=\"menuPath\">Избриши</div>: Состојбата ќе биде избришана.<div class=\"notice\">Бришење на состојба не може да се врати назад со Undo во моменталната верзија 0.2104.5.</div><div class=\"note\">Приказната почнува од почеток со клик на копчето <div class=\"menuPath\">Систем → Ресетирај</div>. Ова ќе ги ресетира сите состојби и ќе ја намести моментално активната состојба на почетната состојба.</div><div class=\"note\">Сите комплексни текстуални полиња препорачано е да се уредуваат со бесплатниот уредувач <a href=\"https://github.com/notepad-plus-plus/notepad-plus-plus/releases/download/v7.9.5/npp.7.9.5.Installer.exe\" class=\"anchorButton compact\">Notepad++</a>, a можат да бидат уредувани и со <a href=\"https://www.microsoft.com/en-us/microsoft-365/word\" class=\"anchorButton compact\">MS Word</a> или со <a href=\"https://download.sublimetext.com/Sublime%20Text%20Build%203211%20x64%20Setup.exe\" class=\"anchorButton compact\">Sublime Text 3</a>.</div>"
    },
	"section-availabilityexpressions": {
      "caption": "🔣 Изрази за достапност",
	  "anchor": "izrazi-za-dostapnost",
      "content": "Изразите за достапност се едноставни (или комплексни) изрази кои ја дефинираат зависноста на моменталната состојба од останати состојби во приказната. <br><br>На пример, зависност би имало меѓу состојбите „Миле зборува со Јасна“ и „Миле ја запознава Јасна“. Состојбата „Миле зборува со Јасна“ би можела да се случи само ако состојбата „Миле ја запознава Јасна“ веќе се има случено. Во овој случај би креирале две состојби и во изразот за достапност на состојбата „Миле зборува со Јасна“ би дефинирале дека „Миле ја запознава Јасна“ мора да се има случено. <br><br>Ако имињата на состојбите се MileZboruvaSoJasna и MileJaZapoznavaJasna тогаш MileZboruvaSoJasna во својот израз за достапност би имала <div class=\"script\"><span class=\"highlight\">HAS_HAPPENED</span> MileJaZapoznavaJasna</div><div class=\"note\">Изразот за достапност го имаат сите состојби освен почетната состојба (таа не зависи од никоја друга состојба), се наоѓа на <a class=\"anchorButton compact\" href=\"#sostojba-uslov-dostapnost\">третата позиција</a> во листата со атрибути на состојбата.</div>Секоја состојба во изразот може да ги даде следните атрибути:<br><br><div class=\"script\"><span class=\"highlight\">HAS_HAPPENED</span> Состојбата</div> : Состојбата се има случено.<br><div class=\"script\"><span class=\"highlight\">CAN_HAPPEN</span> Состојбата</div> : Состојбата може да се случи.<br><div class=\"script\"><span class=\"highlight\">COULD_EVER_HAVE_HAPPENED</span> Состојбата</div> : Состојбата некогаш можела да се случи.<br><div class=\"script\"><span class=\"highlight\">IS_HAPPENING</span> Состојбата</div> : Состојбата се случува во моментов или состојбата е активна.<br><br>Два или повеќе изрази можат да се комбинираат со операторите:<br><br><div class=\"script\">(<span class=\"highlight\">CAN_HAPPEN</span> СостојбаЕден) <span class=\"highlightBlue\">OR</span> (<span class=\"highlight\">IS_HAPPENING</span> СостојбаДва)</div> : Се интерпретира како „Ако може да се случи СостојбаЕден <b>ИЛИ</b> се случува СостојбаДва тогаш оваа состојба може да се случи“.<br><br><div class=\"script\">(<span class=\"highlight\">CAN_HAPPEN</span> СостојбаЕден) <span class=\"highlightBlue\">AND</span> (<span class=\"highlight\">IS_HAPPENING</span> СостојбаДва)</div> : Се интерпретира како „Ако може да се случи СостојбаЕден <b>И</b> се случува СостојбаДва тогаш оваа состојба може да се случи“.<br><br><div class=\"script\"><span class=\"highlightBlue\">NOT</span> (<span class=\"highlight\">IS_HAPPENING</span> СостојбаДва)</div> : Се интерпретира како „Ако не се случува СостојбаДва тогаш оваа состојба може да се случи“.<div class=\"note\">Секој внатрешен израз мора да биде одделен со загради како на примерите погоре.</div><div class=\"note\">Со десен клик на полето за израз за достапност се отвора контекст мени во кое има копчиња за секој атрибут, оператор и состојба. Со клик на нив автоматски се додаваат во изразот на достапност.</div><div class=\"note\">Грешките во изразите за достапност можат да се проучат во <div class=\"menuPath\">Прозорец → Дневник</div><a class=\"anchorButton compact\" href=\"#pomosni-alatki\">Повеќе за дневникот</a></div>"
    },
	"section-viewdialogs": {
      "caption": "🗨️ Преглед на дијалози",
	  "anchor": "pregled-dijalozi",
      "content": "Преглед на дијалози е местото каде писателот може да види како читателот би ја читал приказната. Овој прозорец може да се прикаже или сокрие со клик на менито <div class=\"menuPath\">Прозорец → Преглед на дијалози</div>. Прозорецот изгледа како на сликата подолу.<br><br><img src=\"screenshots/dialogViewer_mk.png\"/><br><br>Со клик на едно од копчињата за дијалог се одбира дијалог и се активира состојбата која соодветствува на тој дијалог."
    },
	"section-creatingdependencies": {
      "caption": "🔗 Врски меѓу состојби",
	  "anchor": "vrski-megju-sostojbi",
      "content": "Врските меѓу состојбите се создаваат автоматски преку изразите за достапност. Визуелно врските можат да се видат преку прозорецот <div class=\"menuPath\">Прозорец → Граф на состојби</div>. Графот на состојби изгледа како на сликата подолу.<br><br><img src=\"screenshots/statesGraph_mk.png\"><br><br><div class=\"note\">Единствениот начин да се направи врска меѓу две состојби е преку изразот на достапност бидејќи комплексноста на изразот не дозволува визуелно поврзување. Графот на состојби постои само за подобро визуелизирање на состојбите.</div>"
    },
	"section-creatingbranches": {
      "caption": "🍃 Гранки",
	  "anchor": "granki",
      "content": "Гранка е пат на активација на состојби. Секое активирање на некоја состојба се бележи во моментално активната гранка создвајќи бележник за историјата на активацијата на состојбите. <br><br>Системот овозможува движење низ времето преку враќање на активирани состојби или одење нанапред по активацијата на состојбите. Ова се прави преку алатките:<br><br><div class=\"menuPath\">Систем → Премотај состојба</div>: Приказната се враќа една состојба наназад низ историјата се додека не се стигне до почетната состојба.<br><div class=\"menuPath\">Систем → Напредни состојба</div>: Приказната се напредува една состојба нанапред во историјата се додека не се стигне до последната активирана состојба.<br><div class=\"menuPath\">Систем → Контрола на времето → (движње на слајдерот)</div>: Приказната се поместува на точната позиција во времето.<br><br>Моменталната гранка може да се зачува преку:<br> <div class=\"menuPath\">Систем → Зачувај гранка → (име на гранката) → Потврди</div><br><br>Секоја именувана гранка може да се вчита, избрише или преименува преку користење на копчињата во менито:<br><div class=\"menuPath\">Систем → Гранки → (име на гранката)</div>"
    },
	"section-usingadditionaltools": {
      "caption": "🛠️ Помошни алатки",
	  "anchor": "pomosni-alatki",
      "content": "Сите проблеми и грешки кои можат да се јават при користењето на алатката се листаат во <div class=\"menuPath\">Прозорец → Дневник</div>. На левата страна се наоѓа бројот на такви „настани“ при користењето, а на десната страна е пораката која ја опишува причината за проблемот. Прозорецот изгледа како на сликата подолу.<br><br><img src=\"screenshots/logWindow_mk.png\"><br><br>Алатката за мониторирање на процесорските перформанси на приказната се наоѓа на <div class=\"menuPath\">Прозорец → Монитор на перформанси</div>, не треба да биде често користена од писатели и читатели."
    },
	"section-tipsandtricks": {
      "caption": "✏️ Совети и трикови",
	  "anchor": "soveti-trikovi",
      "content": "<div class=\"note\">Во <div class=\"menuPath\">изразот за достапност</div> не е воопшто потребно користење тастатура за да се напише самиот израз, иако и тоа е начин. Сите алатки се достапни на десен клик на полето за уредување. Секој дел од изразот може да биде променет преку селектирање на делот од изразот и клик на некој избор во контекстуалното мени на десен клик.</div><div class=\"note\">Секаде каде што има икона на инка тоа значи дека тие полиња можат да се пребаруваат ако напишете критериум на празното место.</div><div class=\"note\">Преку менито <div class=\"menuPath\">Поставки</div> може да биде променет јазикот на интерфејсот или визуелната тема.</div><div class=\"note\">Секоја приказна може да се експортира во .xml формат кој може да се користи на други места или да се споделува преку систем за контрола на верзии како Perforce, Git или Subversion. На ист начин приказните можат да бидат уредувани и импортирани од .xml фајлови. Импортирањето се прави преку копчињата <div class=\"menuPath\">Датотека → Импортирај</div>, <div class=\"menuPath\">Датотека → Ескпортирај</div> и <div class=\"menuPath\">Датотека → Ескпортирај како</div> </div><div class=\"note\">Секој прозорец може да биде преместен со клик на малото триаголниче во горниот лев агол и со влечење на посакуваната позиција.</div><div class=\"note\">Приказните се зачувуваат во истиот фолдер каде се наоѓа <b>NSTEngine.exe</b> во суб-фолдерот <b>stories</b>, личностите се во суб-фолдерот <b>characters</b>, дневниците во суб-фолдерот <b>logs</b>, а експортираните XML фајлови се наоѓаат во суб-фолдерот <b>exports</b>.</div><div class=\"note\">Кратенки за тастатура: <br><br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">S</div> Зачувај ја приказната<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">N</div> Креирај нова приказна<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">R</div> или <div class=\"kbc-button\">F5</div> Ресетирај ја приказната<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">←</div> Премотај ја состојбата<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">→</div> Напредни ја состојбата<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">SHIFT</div><div class=\"kbc-button\">DEL</div> Избриши ја моментално селектираната состојба<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">U</div> Ажурирај ги селектиранта состојбата и селектираната личност<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">А</div> Пробај да ја активираш моментално селектираната состојба<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">F</div> Активирај ја состојбата без разлика на достапноста<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">Е</div> Направи ја моментално селектираната состојба како почетна состојба<br><div class=\"kbc-button\">CTRL</div><div class=\"kbc-button\">D</div> Креирај основна состојба</div>"
    },
	"section-wheretonext": {
      "caption": "🤖 Каде од тука?",
	  "anchor": "kade-od-tuka",
      "content": "Придружи се на официјалниот <a class=\"anchorButton compact\"  href=\"https://discord.gg/sxeD79nuBP\">дискорд сервер</a> или контактирај ме на <a class=\"anchorButton compact\" href=\"mailto:deeeeelay@gmail.com\">мејл</a> или на <a class=\"anchorButton compact\" href=\"https://www.instagram.com/najnajjak/\">инстаграм</a>! NST е развиен како дипломски труд од Мартин Петковски.</div>"
    }
  }
}