{
    "reviews" :
    [
        {
            "title" : "Masayoshi Takanaka ‎– An Insatiable High ",
            "type" : "Music Album",
            "rating" : "86",
            "description" : "Сатрдеј најт спешал. Начинот на кој шо е продуциран и како овај албум звучи е фасцинантен и го добива специјалниот печат на одобрување Americunts can't do this kinda shit Иако инструментален во поголемиот дел, содржи многу впечатливи мелодии и интересни хукој шо нема да го остај никој рамнодушен. По само едно слушање ќе хамовате мелодии дури вадите кашкавал од фрижидеро. Malibu ми е личен фаворит. Ама и другите се прејаки. Classica."
        },
        {
            "title" : "American Football LP3",
            "type" : "Music Album",
            "rating" : "70",
            "description" : "Ова е мојата импресија по првото слушање на новио албум на мојо омилен бенд од доцните пубертетски деној.Прво, овај албум исто ко впрочем и вторио, апсолутно немат врска со првиот албум кој шо е неспорно најдобар и според мене сѐ уште е еден од најдобрите албуми на сите времиња. LP3 е препродуциран и звучи ко буржоаски албум шо е тотална спротивност на првио албум. Пак звучи ко Owen на стероиди, не можи то да се негира, воглавно заради начино на пеење на Мајк шо мене лично не ме бендисва. Да, има многу поќе инструментални делој од шо имаше LP2 кој беше преплавен од Owen-штина, ама ептем се познава дека ги слушат хејт коментарите за LP2 меѓу кои најгласен беше тој дека „нема доволно инструментални делој“ - поштовам. Патем, инструменталните делој се okay-ish, нема премногу кечинес ама се пријатни за слушање и одлично го доловуват тој мидвест-20:00-доцнолето-балисено вајб. Uncomfortably numb е кајнда кечи ама не химнеста. Хајли е на место. Спото не ме бендиса. Многу ме бендисва ксилофоно на песната со Рејчел Госвел и пеењето на Рејчел е во стил на Slowdive, ама самата песна многу личи на сите останати песни или просто речено не е кечи. Елизабет Пауел не знам која е, ама песната со неа имаше најмногу содржина од трите соработки на албумо. Генерално самото гостување на вија артисти го гледам ко многу позитивно пошто се познава дека имат внесено нешто свое шо е јако и ја подобрува сликата за Американ Футбал. Ова ме води до главната поента за албумо, а то е дека чудно е како една песна на LP3 можи да биди 2/10 во еден свој дел, а во друг можи да е 11/10. Типичен пример за ова е Heir Apparent шо е многу досадна до својата ~4-та минута, а после експлодира во емотивен, неистражен, неочекуван и кечи терен. Првиот дел од песната појма неам како оди и не ме ни интересира, ама вториот си го хамовам дури одам по улица. Ако песната беше само од 3:50 до крајот ќе беше најдобрата на албумот со голема маргина до втората најдобра. Иронично е шо сите делој шо ме бендисаја технички не се од Американ Футбал туку тие само се „бендот шо ја свири та песна или дел“ и то збора за насоката во која мислам дека се движат Американ Футбал - безидејност. Има шанса да го сменам мислењето по неколку слушања, како шо напрајв со LP2, па така можи да има уште некој пост на ова тема во иднина. Needs more trumpet!"
        },
        {
            "title" : "Millko - Nokj ko vitez vojuva",
            "type" : "Music Album",
            "rating" : "70",
            "description" : "Ете шо ми е на рипит денес цел ден, а и ќе продолжи да ми е во наредните неколку дена. Генерално ваков тип на инди-рок со акустични гитари и рамен ритам не ми е cup of tea од ко излегов од пубертет пред три животи, ама ова е исклучок. Вокалите на Сашо ко и стално се top notch и примарна причина оти песната ми е толку јака. Бојата на гласо е невообичаено сонлива многу одговара на начино на кој шо пеј. Емотивната катарза во интерлудето и рефрено е ептем погодена, ти иди да пејш иако не ја знајш песната. Она шо јас би го напрајл поинаку се поеџи гитари на рефрено и наместо Grand Piano би одел некој Grand Pad, пошто вака исто ко да го нема пијаното. MXR Carbon Copy и Phase 90 уште еднаш докажват дека, иако едноставни вадат, одличен тон (како да имаше некаков сомнеж некогаш). Басо е spot on, и песната многу јако завршва. Топло препорачвам."
        },
        {
            "title" : "Barum Tonen",
            "type" : "Music Album",
            "rating" : "25",
            "description" : "Мирко Попот има нов проект? Вакви антимелодични глупости само од неговиот круг можат да излезат. Не бев сигурен дали звучната лошо ми баферира или таква е музиката, па морав да ја ресетирам и да пуштам нешто друго за да се уверам дека не е до мене. Уште не сум сигурен пошто можно е SoundCloud да е багнат, ако можи некој да ми потврди би било супер. Неам шо да додам на ова."
        },
        {
            "title" : "Rib S/T",
            "type" : "Music Album",
            "rating" : "40",
            "description" : "Го преслушав цел албум и колку и да нејќам да речам - досаден е. Пријатна е музиката ко за програмирање ама ептен му фали ЕЏ. Да не ја букмаркнев мислам дека немаше да знам дека ова песна се вика Chanson No.1. Rotator ми беше најинтересна, пошто јебига има вокал. Ама се чини дека никој не презема нешто за да било која нота не е иссвирена на прво време. Продукцијата е as мех as it gets. Ако програмирате или нејќите музиката да ви земи голем дел од капацитето за размислување - ќе ве бендиса исто ко и мене шо ме бендиса."
        },
        {
            "title" : "Zulu 3.4 - Pretty Things",
            "type" : "Song",
            "rating" : "46",
            "description" : "Малку е чудно шо Били Корган почна џез да свири. Секој момент очекував да викни QUIEEET, ама не, ова е доволно тивко. Тоно на гитарата и на пијаното е џам. Рифчето кај 2:33 е џам. Шо е со тоно на тапаните не знам, ама ми се чини ко сите песни снимени во алшар имат ист тон на тапаните. Нејсе, генерално многу убав вајб има музиката. Освен рифчињата шо се хајлајт (а ги има), останатото е интересно се дури одиш на работ пишејќи void* иако постои functional.h. Ги преслушав сите песни и можам да речам дека има доза на кечинес, и покрај то шо музиката не е типично кечи, ама не доволно за да оди на рипит. Шо ме води до клучната поента - музиката е уба за слушање ама некако ко да е без стил, шо се вели, не го прај филмо. Пример видеото да беше со некои пејзажи од Исланд (лупам са, мене таков вајб ми има) тогаш друг муабет. Или ете една слика од то на шо ги потсеќа песната членојте на бендо прај убав пат кон дефинирање комплетен стил. Вака е малце рандом. Ми се чини да избоцкам и јас рандом ноти на гитара (иако сите знајме дека не е така) ќе излези нешто вакво. Супстанцата е во „Зошто?“."
        },
        {
            "title" : "Stephen Malkmus - Groove Denied",
            "type" : "Music Album",
            "rating" : "81",
            "description" : "Стивен (онај од Пејвмент) има средовечна криза и супер му оди! Видеото е пресмешно, а не е дека и песната не е пресмешна. Од продукциски аспект многу ме бендисва пошто е за нигде ама за нигде на убав начин - не зрачи ко да му е гајле на некој дека е за нигде. Па уште и ситар има замисли. На скалата на кечинес песната е бордерлајн кечи, а на скалата на бедеснесс е бедес ес фак."
        },
        {
            "title" : "Foolinsh Green - Soul Revival",
            "type" : "Song",
            "rating" : "77",
            "description" : "Песната е 👌👌👌, ама и покрај то би ја сместил негде во просечните филери ако би била на албумот Escape. Хукот не е доволно кечи за да можи да биди хит и премногу е слична во скоро сите аспекти на песните од претходниот албум кој излезе пред 6-7 години, почнувајќи од мелодиите па се до видеото. Да не знаев дека е нова би рекол дека е од Escape. Продукциски и стилски Foolish Green се можеби и најавтентичниот македонски бенд некогаш, иако Ненад пеј на англиски. Но! Иако сум голем хејтер на англиски јазик кај македонски артисти, не мислам дека во овој (специјален) случај во песната проблем е англискиот јазик ниту акцентот на вокалот, напротив, додаваат убав зачин на автентичноста. Формулата која во себе има акустична гитара + виолончело + мистериозни падој + длабоки дебели удирачки инстументи искористени на вистински начин и во вистинско време во аранжманот - се уште одлично функционира. Иако очекував следниот чекор да им биде повеќе во насока на вестерн отколку на психоделичен/спејс рок, Foolish Green дефинитивно продолжуваат да бидат она шо Arctic Monkeys од лани се во неуспешен обид да бидат. Го заслужуваат вашето 5 минутно внимание."
        }
    ]
}
